# GetDashStyleName

## Description
Deprecated - will generate error. Use GetDashLineTypeName instead.&lt;BR&gt;
&lt;BR&gt;
Retrieves the dash style name of the specified dash style index.

```pascal
FUNCTION GetDashStyleName(DashStyleIndex : INTEGER) : STRING;
```

```python

def vs.GetDashStyleName(DashStyleIndex):
    return STRING
```

## Parameters
|Name|Type|Description|
|---|---|---|
|DashStyleIndex|INTEGER|The the index of the dash style.|

## Returns
Name of the dash style specified by the index.

## Remarks
Deprecated - will generate error. Use GetDashLineTypeName instead.

## See Also
VS Functions:
GetDashLineTypeName

## Version
```diff
- GetDashStyleName is obsolete as of Vectorworks 2019
```

Availability: from Vectorworks 2011
## Category
* Object Names